### Pandas-DataFrame And Series 
#### Pandas is a powerful data manipulation library in python, widely used for  data analysis and data cleaning. it provides two primary data structures: series and dataframe. a series is a one dimensional array-like object, while a dataframe is two-dimensional, size-mutable,and potenially heterogenous tabular data structure with labeled axes(rows and columns).

In [8]:
import pandas as pd

In [9]:
## Series 
### A series is a one dimensional array-like object that can hold any data type. it is similar to a column in a table.
import pandas as pd
data=[1,2,3,4,5]
s=pd.Series(data)
print("Series\n",s)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [10]:
## Create a Series from dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [11]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [12]:
## DataFrame
## create a dataframe from a dictionary of list

data={
    "name":['krish','john','jack'],
    "age" :[24,30,36],
    "city":['bangalore','mumbai','pune']
}

df=pd.DataFrame(data)
print(df)
print(type(df))

    name  age       city
0  krish   24  bangalore
1   john   30     mumbai
2   jack   36       pune
<class 'pandas.core.frame.DataFrame'>

In [13]:
import numpy as np
np.array(df)

array([['krish', 24, 'bangalore'],
       ['john', 30, 'mumbai'],
       ['jack', 36, 'pune']], dtype=object)

In [14]:
## Create a dataframe from a list of dictionaries

data=[
    {"name":'krish',"age":24,"city":'bangalore'},
    {"name":'john', "age":30,"city":'mumbai'},
    {"name":'ishan',"age":35,"city":'pune'},
    {"name":'jack', "age":40,"city":'delhi'}
]

daf=pd.DataFrame(data)
print(daf)
print(type(daf))

    name  age       city
0  krish   24  bangalore
1   john   30     mumbai
2  ishan   35       pune
3   jack   40      delhi
<class 'pandas.core.frame.DataFrame'>

In [15]:
df=pd.read_csv("example.csv")
df.head()

,Person ID,Gender,Age,Occupation,Sleep Duration,Quality of Sleep,Physical Activity Level,Stress Level,BMI Category,Blood Pressure,Heart Rate,Daily Steps,Sleep Disorder
0,1,Male,25,Software Engineer,6.1,6,42,6,Overweight,126/83,77,4200,NaN
1,2,Male,28,Doctor,6.2,6,60,8,Normal,125/80,75,10000,NaN
2,3,Male,28,Doctor,6.2,6,60,8,Normal,125/80,75,10000,NaN
3,4,Male,28,Sales Representative,5.9,4,30,8,Obese,140/90,85,3000,Sleep Apnea
4,5,Male,28,Sales Representative,5.9,4,30,8,Obese,140/90,85,3000,Sleep Apnea

In [16]:
df.tail()

,Person ID,Gender,Age,Occupation,Sleep Duration,Quality of Sleep,Physical Activity Level,Stress Level,BMI Category,Blood Pressure,Heart Rate,Daily Steps,Sleep Disorder
369,370,Female,59,Nurse,8.1,9,75,3,Overweight,140/95,68,7000,Sleep Apnea
370,371,Female,59,Nurse,8.0,9,75,3,Overweight,140/95,68,7000,Sleep Apnea
371,372,Female,59,Nurse,8.1,9,75,3,Overweight,140/95,68,7000,Sleep Apnea
372,373,Female,59,Nurse,8.1,9,75,3,Overweight,140/95,68,7000,Sleep Apnea
373,374,Female,59,Nurse,8.1,9,75,3,Overweight,140/95,68,7000,Sleep Apnea

In [17]:
print(df.head())

   Person ID Gender  Age            Occupation  Sleep Duration  \
0          1   Male   25     Software Engineer             6.1
1          2   Male   28                Doctor             6.2
2          3   Male   28                Doctor             6.2
3          4   Male   28  Sales Representative             5.9
4          5   Male   28  Sales Representative             5.9

   Quality of Sleep  Physical Activity Level  Stress Level BMI Category  \
0                 6                       42             6   Overweight
1                 6                       60             8       Normal
2                 6                       60             8       Normal
3                 4                       30             8        Obese
4                 4                       30             8        Obese

  Blood Pressure  Heart Rate  Daily Steps Sleep Disorder
0         126/83          77         4200            NaN
1         125/80          75        10000            NaN
2         125/80          75        10000            NaN
3         140/90          85         3000    Sleep Apnea
4         140/90          85         3000    Sleep Apnea

In [18]:
## Accessing data from dataframe
data

[{'name': 'krish', 'age': 24, 'city': 'bangalore'},
 {'name': 'john', 'age': 30, 'city': 'mumbai'},
 {'name': 'ishan', 'age': 35, 'city': 'pune'},
 {'name': 'jack', 'age': 40, 'city': 'delhi'}]

In [19]:
daf

    name  age       city
0  krish   24  bangalore
1   john   30     mumbai
2  ishan   35       pune
3   jack   40      delhi

In [20]:
daf["name"]

0    krish
1     john
2    ishan
3     jack
Name: name, dtype: object

In [21]:
type(daf["name"])

pandas.core.series.Series

In [22]:
daf.loc[0]

name        krish
age            24
city    bangalore
Name: 0, dtype: object

In [23]:
daf.iloc[0]

name        krish
age            24
city    bangalore
Name: 0, dtype: object

In [24]:
daf.iloc[0][0]

C:\Users\priya\AppData\Local\Temp\ipykernel_3832\2824717993.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  daf.iloc[0][0]

'krish'

In [25]:
## Accessing a specified element
daf.at[1,'age']

np.int64(30)

In [26]:
daf.at[1,'name']

'john'

In [27]:
## Accessing a specified element using list
daf.iat[2,2]

'pune'

In [28]:
### data manipulation with datframe
daf

    name  age       city
0  krish   24  bangalore
1   john   30     mumbai
2  ishan   35       pune
3   jack   40      delhi

In [29]:
## adding a column
daf["salary"]=[20000,30000,40000,50000]

In [30]:
daf

    name  age       city  salary
0  krish   24  bangalore   20000
1   john   30     mumbai   30000
2  ishan   35       pune   40000
3   jack   40      delhi   50000

In [31]:
## remove a column
daf.drop("salary",axis=1)

    name  age       city
0  krish   24  bangalore
1   john   30     mumbai
2  ishan   35       pune
3   jack   40      delhi

In [32]:
daf

    name  age       city  salary
0  krish   24  bangalore   20000
1   john   30     mumbai   30000
2  ishan   35       pune   40000
3   jack   40      delhi   50000

In [33]:
daf.drop("salary",axis=1,inplace=True)

In [34]:
daf

    name  age       city
0  krish   24  bangalore
1   john   30     mumbai
2  ishan   35       pune
3   jack   40      delhi

In [35]:
## add age to the column
daf["age"]=daf["age"]+1

In [36]:
daf

    name  age       city
0  krish   25  bangalore
1   john   31     mumbai
2  ishan   36       pune
3   jack   41      delhi

In [37]:
daf.drop(0)

    name  age    city
1   john   31  mumbai
2  ishan   36    pune
3   jack   41   delhi

In [38]:
daf

    name  age       city
0  krish   25  bangalore
1   john   31     mumbai
2  ishan   36       pune
3   jack   41      delhi

In [39]:
daf.drop(0,inplace=True)

In [40]:
daf

    name  age    city
1   john   31  mumbai
2  ishan   36    pune
3   jack   41   delhi

In [41]:
df=pd.read_csv("example.csv")
df.head()

,Person ID,Gender,Age,Occupation,Sleep Duration,Quality of Sleep,Physical Activity Level,Stress Level,BMI Category,Blood Pressure,Heart Rate,Daily Steps,Sleep Disorder
0,1,Male,25,Software Engineer,6.1,6,42,6,Overweight,126/83,77,4200,NaN
1,2,Male,28,Doctor,6.2,6,60,8,Normal,125/80,75,10000,NaN
2,3,Male,28,Doctor,6.2,6,60,8,Normal,125/80,75,10000,NaN
3,4,Male,28,Sales Representative,5.9,4,30,8,Obese,140/90,85,3000,Sleep Apnea
4,5,Male,28,Sales Representative,5.9,4,30,8,Obese,140/90,85,3000,Sleep Apnea

In [42]:
df=pd.read_csv("example.csv")
df.head(9)

,Person ID,Gender,Age,Occupation,Sleep Duration,Quality of Sleep,Physical Activity Level,Stress Level,BMI Category,Blood Pressure,Heart Rate,Daily Steps,Sleep Disorder
0,1,Male,25,Software Engineer,6.1,6,42,6,Overweight,126/83,77,4200,NaN
1,2,Male,28,Doctor,6.2,6,60,8,Normal,125/80,75,10000,NaN
2,3,Male,28,Doctor,6.2,6,60,8,Normal,125/80,75,10000,NaN
3,4,Male,28,Sales Representative,5.9,4,30,8,Obese,140/90,85,3000,Sleep Apnea
4,5,Male,28,Sales Representative,5.9,4,30,8,Obese,140/90,85,3000,Sleep Apnea
5,6,Male,28,Software Engineer,5.9,4,30,8,Obese,140/90,85,3000,Insomnia
6,7,Male,29,Teacher,6.3,6,40,7,Obese,140/90,82,3500,Insomnia
7,8,Male,29,Doctor,7.8,7,75,6,Normal,120/80,70,8000,NaN
8,9,Male,29,Doctor,7.8,7,75,6,Normal,120/80,70,8000,NaN

In [43]:
## Display the data types of each column 
print("data types:\n",df.dtypes)

## Describe the dataframe 
print("statistical summary:\n",df.describe())

data types:
 Person ID                    int64
Gender                      object
Age                          int64
Occupation                  object
Sleep Duration             float64
Quality of Sleep             int64
Physical Activity Level      int64
Stress Level                 int64
BMI Category                object
Blood Pressure              object
Heart Rate                   int64
Daily Steps                  int64
Sleep Disorder              object
dtype: object
statistical summary:
         Person ID         Age  Sleep Duration  Quality of Sleep  \
count  374.000000  374.000000      374.000000        374.000000
mean   187.500000   42.179144        7.132086          7.312834
std    108.108742    8.683132        0.795657          1.196956
min      1.000000   25.000000        5.800000          4.000000
25%     94.250000   35.250000        6.400000          6.000000
50%    187.500000   43.000000        7.200000          7.000000
75%    280.750000   50.000000        7.800000          8.000000
max    374.000000   59.000000        8.500000          9.000000

       Physical Activity Level  Stress Level  Heart Rate   Daily Steps
count               374.000000    374.000000  374.000000    374.000000
mean                 59.171123      5.385027   70.165775   6816.844920
std                  20.830804      1.774526    4.135676   1617.915679
min                  30.000000      3.000000   65.000000   3000.000000
25%                  45.000000      4.000000   68.000000   5600.000000
50%                  60.000000      5.000000   70.000000   7000.000000
75%                  75.000000      7.000000   72.000000   8000.000000
max                  90.000000      8.000000   86.000000  10000.000000

In [44]:
df.describe()

,Person ID,Age,Sleep Duration,Quality of Sleep,Physical Activity Level,Stress Level,Heart Rate,Daily Steps
count,374.000000,374.000000,374.000000,374.000000,374.000000,374.000000,374.000000,374.000000
mean,187.500000,42.179144,7.132086,7.312834,59.171123,5.385027,70.165775,6816.844920
std,108.108742,8.683132,0.795657,1.196956,20.830804,1.774526,4.135676,1617.915679
min,1.000000,25.000000,5.800000,4.000000,30.000000,3.000000,65.000000,3000.000000
25%,94.250000,35.250000,6.400000,6.000000,45.000000,4.000000,68.000000,5600.000000
50%,187.500000,43.000000,7.200000,7.000000,60.000000,5.000000,70.000000,7000.000000
75%,280.750000,50.000000,7.800000,8.000000,75.000000,7.000000,72.000000,8000.000000
max,374.000000,59.000000,8.500000,9.000000,90.000000,8.000000,86.000000,10000.000000